package migrate

import (
	"fmt"
	"gorm.io/gorm"
)

type FrontGroupMigrate_20220930183037 struct {
	Name string
}

var cateNames = []string{
	"美业群", "行业群", "高校群", "求职招聘群", "相亲交友群", "微商群", "联盟群", "二手车群",
	"闲货处理群", "宝妈群", "创业群", "其他群", "其他互助群", "红包群", "兼职群", "拼多多互助群", "资源互换群",
}

func (tx FrontGroupMigrate_20220930183037) Up(db *gorm.DB) {
	data := []string{
		"('哈尔滨同城福利群', 2, 14, NULL, '同城各种商家优惠福利尽在其中', 0, 1020, 1, 3, NULL, NULL);",
		"('哈尔滨吃喝玩乐群', 2, 14, NULL, '哈尔滨各种娱乐优惠尽在其中', 0, 1019, 1, 3, NULL, NULL);",
		"('哈尔滨同城交友群', 2, 9, NULL, '同城单身男女交友群，不定期举行聚会', 0, 1018, 1, 3, NULL, NULL);",
		"('哈尔滨求职招聘群', 2, 1, NULL, '求职招聘，找工作招员工再群内互动', 0, 1017, 1, 3, NULL, NULL);",
		"('哈尔滨商业联盟群', 2, 13, NULL, '商家寻求合作，寻找资源互换尽在其中', 0, 1016, 1, 3, NULL, NULL);",
		"('哈尔滨副业兼职群', 2, 20, NULL, '日薪一日一结工作，保300+工资', 0, 1015, 1, 3, NULL, NULL);",
		"('微信分享赚红包群', 2, 16, NULL, '群内发布信息，转发好友或朋友，浏览即可获得红包', 0, 1014, 1, 3, NULL, NULL);",
		"('哈尔滨美容院免费拓客群', 2, 11, NULL, '免费合作线上拓客模式', 0, 1013, 1, 3, NULL, NULL);",
		"('哈尔滨创业联盟群', 2, 20, NULL, '创业没有人，没有钱，没有资源，本群内互动寻找', 0, 1012, 1, 3, NULL, NULL);",
		"('厂价美容仪器供货群', 2, 11, NULL, '广州国产美容仪器生产厂家提供优质低价仪器', 0, 1011, 1, 3, NULL, NULL);",
		"('美业技术技能培训群', 2, 11, NULL, '免费培训美容行业人员美容美体养生等技术技能群', 0, 1010, 1, 3, NULL, NULL);",
		"('哈尔滨医疗美容福利群', 2, 11, NULL, '哈尔滨医疗美容沟通互动交流福利群', 0, 1009, 1, 3, NULL, NULL);",
		"('微信软件APP代理招商群', 2, 12, NULL, '企业营销软件，微商软件，营销互动软件批发代理', 0, 1008, 1, 3, NULL, NULL);",
		"('信用卡POS机办理赠送群', 2, 16, NULL, '大额信用卡办理，各种POS机办理，代理招商群', 0, 1007, 1, 3, NULL, NULL);",
		"('美容院项目铺货合作群', 2, 11, NULL, '美业项目营销合作，免费铺货，免费培训，免费营销方案合作分成', 0, 1006, 1, 3, NULL, NULL);",
		"('哈尔滨80后交友群', 2, 9, NULL, '哈尔滨80后有家创业一代交友互动群', 0, 1005, 1, 3, NULL, NULL);",
		"('美业资源互换共享群', 2, 11, NULL, '美业资源互通群，有项目找店，有店找项目，资源共享赚利润差价', 0, 1004, 1, 3, NULL, NULL);",
		"('哈尔滨教育机构合作群', 2, 5, NULL, '哈尔滨各种课外教育，兴趣教育合作招生推广群', 0, 1003, 1, 3, NULL, NULL);",
		"('哈尔滨吃喝玩乐福利群', 2, 14, NULL, '本地吃喝玩乐各种优惠福利群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨同城招聘求职群', 2, 1, NULL, '本地招聘求职群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨同城相亲交友群', 2, 9, NULL, '本地相亲交友', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨零首付购车群', 2, 10, NULL, '二手车交易，办理驾照，检车保险等', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨商家免费宣传推广群', 2, 13, NULL, '本地商家免费合作梁梦推广宣传群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨零首付购车群', 2, 10, NULL, '零首付购车，办理驾照，检车，保险等！', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨同城相亲交友群', 2, 9, NULL, '哈尔滨相亲交友群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨餐饮行业宣传群', 2, 5, NULL, '哈尔滨酒店餐饮行业沟通交流经验群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨高校学生兼职创业群', 2, 17, NULL, '哈尔滨高校学生群', 0, 1, 1, 3, NULL, NULL);",
		"('哈尔滨企业合作联盟推广群', 2, 13, NULL, '哈尔滨商家联合推广合作群', 0, 1, 1, 3, NULL, NULL);",
		"('美业老板人脉圈001站', 2, 11, NULL, '欢迎各位企业老板和店长进群互换资源人脉！', 0, 0, 1, 3, NULL, NULL);",
		"('长春吃喝玩乐福利群', 2, 14, NULL, '本地吃喝玩乐各种优惠福利群', 0, 0, 1, 3, NULL, NULL);",
		"('沈阳吃喝玩乐福利群', 2, 14, NULL, '本地吃喝玩乐各种优惠福利群', 0, 0, 1, 3, NULL, NULL);",
		"('健身瑜伽行业交流群', 2, 5, NULL, '本地健身瑜伽合作群', 0, 0, 1, 3, NULL, NULL);",
		"('美甲美睫行业交流群', 2, 5, NULL, '美甲美睫行业交流群', 0, 0, 1, 3, NULL, NULL);",
		"('美体塑形内衣群', 2, 8, NULL, '厂家直销美体内衣群', 0, 0, 1, 3, NULL, NULL);",
		"('微整纹绣行业交流群', 2, 11, NULL, '本地微整纹绣交流群', 0, 0, 1, 3, NULL, NULL);",
		"('黑龙江美容行业交流群', 2, 11, NULL, '黑龙江美容行业交流群', 0, 0, 1, 3, NULL, NULL);",
		"('微商软件代理群', 2, 12, NULL, '诚招全国微商软件代理', 0, 0, 1, 3, NULL, NULL);",
		"('哈尔滨群力中海寰宇天下社区群', 2, 16, NULL, '进群可以享受本社区周边商家推广优惠福利！', 0, 0, 1, 3, NULL, NULL);",
		"('美容瑜伽免费福利群', 2, 16, NULL, '凡拉两位微信好友进群即可获得本店免费美容体验一次，瑜伽练习周卡一张，豆咖甜点5元代金券4张！群主添加微信领取！', 0, 0, 1, 3, NULL, NULL);",
		"('东北三省美容行业交流群', 2, 11, NULL, '东北三省美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 3, NULL, NULL);",
		"('黑龙江美容行业交流20群', 2, 11, NULL, '黑龙江省美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 3, NULL, NULL);",
		"('哈尔滨美容行业交流30群', 2, 11, NULL, '哈尔滨地区美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 3, NULL, NULL);",
		"('哈尔滨美容行业交流20群', 2, 11, NULL, '哈尔滨地区美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 3, NULL, NULL);",
		"('黑龙江美容行业交流10群', 2, 11, NULL, '黑龙江省美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 3, NULL, NULL);",
		"('哈尔滨美容行业交流10群', 2, 11, NULL, '哈尔滨地区美容行业拓客、营销、品牌、项目、人才合作交流群！', 0, 0, 1, 5, NULL, NULL);",
		"('民权精致女人抗衰群', 2, 11, NULL, '美容养生群', 0, 0, 1, 3, NULL, NULL);",
		"('拼多多互助群', 2, 18, NULL, '拼多多相互帮忙砍价！', 0, 0, 1, 3, NULL, NULL);",
		"('宝妈创业服务群', 2, 19, NULL, '宝妈创业服务群', 0, 0, 1, 3, NULL, NULL);",
		"('商业联盟合作创业群', 2, 20, NULL, '商业联盟合作创业群', 0, 0, 1, 3, NULL, NULL);",
		"('美容仪器厂家调货群', 2, 16, NULL, '厂家直销美容仪器，同行调货，一件批发！', 0, 0, 1, 3, NULL, NULL);",
	}
	for _, item := range data {
		sql := fmt.Sprintf("INSERT INTO `groups` ( `title`, `uniacid`, `classid`, `qrcode`, `label`, `type`, `rank_score`, `is_show`, `status`, `tag`, `thumb`) VALUES %s", item)
		db.Exec(sql)
	}

	for _, catename := range cateNames {
		sql := fmt.Sprintf("INSERT INTO categories (`name`,`status`) VALUES ('%s',1);", catename)
		db.Exec(sql)
	}
	fmt.Printf("SystemInitMigrate up")
}

func (tx FrontGroupMigrate_20220930183037) Down(db *gorm.DB) {

}

func (tx FrontGroupMigrate_20220930183037) FileName() string {
	return tx.Name
}
